public_html/articles/php/openid.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">OpenID по русски</a></li>
<li><a href="#unnumbered-2">Ресурсы</a></li>
<li><a href="#unnumbered-3">Решения</a></li>
</ul>
</div>
</div>
<p>
В словаре веб-программистов есть специфическое слово
"прикрутить". Когда нужно найти инфу по незнакомой теме, такой,
например, как "OpenID", первое что делает программист - лезет в
гугль. Обычный программист набирает что-то вроде "OpenID
specification". Наш программист не хочет читать спецификации, он хочет
сразу, быстро, и желательно по-русски. Поэтому его запрос примерно
такой: "PHP OpenID прикрутить". Для того, чтобы облегчить жизнь такому
программисту я и написал этот абзац.
</p>

<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">OpenID по русски</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Итак, стоит задача - у себя на хостинге сделать OpenID-сервер, чтобы
можно было оставлять комментарии в различных блогах, используя как
удостоверение своей личности свой сайт (на котором может быть блог, а
может и не быть). Прочтение спецификации не приводит к просветлению,
но все-же имеет смысл:
</p>

<p>
&lt;a href="<a href="http://ru.wikipedia.org/wiki/OpenID">http://ru.wikipedia.org/wiki/OpenID</a>"&gt;
  <a href="http://ru.wikipedia.org/wiki/OpenID">http://ru.wikipedia.org/wiki/OpenID</a>
&lt;/a&gt; - на русском
&lt;a href="<a href="http://openid.net/specs/openid-authentication-2_0.html">http://openid.net/specs/openid-authentication-2_0.html</a>"&gt;
  <a href="http://openid.net/specs/openid-authentication-2_0.html">http://openid.net/specs/openid-authentication-2_0.html</a>
&lt;/a&gt; - спецификация
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Ресурсы</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Традиционно обращаемся к блогам за критикой спецификаций и
дополнительной информацией:
</p>

<p>
Этот человек внес струю свежего воздуха в мой воспаленный мозг :)
Нашел много полезного, например:
<a href="http://david-m.livejournal.com/760821.html">http://david-m.livejournal.com/760821.html</a> - это реализованный
OpenID-consumer, т.е. сервис, проверяющий идентификацию - им удобно
отлаживать свой OpenID сервер.  &lt;a
href="<a href="http://david-m.livejournal.com/tag/openid">http://david-m.livejournal.com/tag/openid</a>"&gt;ЖЖ Давида
Мзареуляна&lt;/a&gt; (записи с тегом OpenId)
</p>

<p>
Запись в блоге МакСима, которая будет интересна пользователям
мастерхоста (я один из них), у которых PHP скомпилирован без поддержки
CURL.  &lt;a
href="<a href="http://mak-sim.ru/2007/02/28/95">http://mak-sim.ru/2007/02/28/95</a>"&gt;<a href="http://mak-sim.ru/2007/02/28/95">http://mak-sim.ru/2007/02/28/95</a>&lt;/a&gt;
</p>

<p>
Сценарий раскрытия пароля при использовании OpenId от &lt;lj
user="mderk"&gt; &lt;a
href="<a href="http://www.ragbag.ru/2007/01/21/openid_phishing/">http://www.ragbag.ru/2007/01/21/openid_phishing/</a>"&gt;<a href="http://www.ragbag.ru/2007/01/21/openid_phishing/">http://www.ragbag.ru/2007/01/21/openid_phishing/</a>&lt;/a&gt;
</p>

<p>
Иван Сагалаев, хоть пишет и не на PHP - зато разумно и по
делу. Затрагиваются и смежные области. Много хороших идей, которые
&lt;s&gt;так хочется спиздить&lt;/s&gt; нуждаются в разработке.  &lt;a
href="<a href="http://softwaremaniacs.org/blog/2007/03/25/cicero-openid-hcard/">http://softwaremaniacs.org/blog/2007/03/25/cicero-openid-hcard/</a>"&gt;<a href="http://softwaremaniacs.org/blog/2007/03/25/cicero-openid-hcard/">http://softwaremaniacs.org/blog/2007/03/25/cicero-openid-hcard/</a>&lt;/a&gt;
&lt;a
href="<a href="http://softwaremaniacs.org/blog/2007/03/28/openid-mutants/">http://softwaremaniacs.org/blog/2007/03/28/openid-mutants/</a>"&gt;<a href="http://softwaremaniacs.org/blog/2007/03/28/openid-mutants/">http://softwaremaniacs.org/blog/2007/03/28/openid-mutants/</a>&lt;/a&gt;
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Решения</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
Теперь, когда мы знаем все, что нам нужно про OpenID, можно приступать
к поиску готовых решений, которые можно использовать в своих
проектах. На текущий момент я нашел несколько, буду признателен, если
кто-нибудь дополнит.
</p>

<p>
&lt;a
href="<a href="http://www.openidenabled.com/">http://www.openidenabled.com/</a>"&gt;<a href="http://www.openidenabled.com/">http://www.openidenabled.com/</a>&lt;/a&gt;
PHP OpenID Library - (не только PHP). Выглядит монструозно, на
мастерхосте не заработала, потому что не смогла найти XML-парсер
(привет админам Мастерхоста - всерьез думаю о том, чтобы менять
хостинг).
</p>

<p>
&lt;a
href="<a href="http://www.phpclasses.org/browse/package/3290.html">http://www.phpclasses.org/browse/package/3290.html</a>"&gt;<a href="http://www.phpclasses.org/browse/package/3290.html">http://www.phpclasses.org/browse/package/3290.html</a>&lt;/a&gt;
Simple OpenID PHP Class - спасибо, Дима Смирнов. У меня не заработал,
потому что на мастерхосте PHP скомпилирован без CURL. (ненавижу!)
</p>

<p>
&lt;a
href="<a href="http://siege.org/projects/phpMyID/">http://siege.org/projects/phpMyID/</a>"&gt;<a href="http://siege.org/projects/phpMyID/">http://siege.org/projects/phpMyID/</a>&lt;/a&gt;
Этот проект, состоящий всего из двух небольших файлов - заработал
сразу. И действительно, многое встает на свои места при просмотре его
кода. Он использует Basic HTTP-авторизацию, что в коде выглядит очень
компактно (но если хотите можно легко заменить на привычную
веб-авторизацию). Он не требует базы данных, поддержки XML или
чего-нибудь подобного. Пожалуй, можно рекомендовать.
</p>
</div>
</heading>
